bricks/olymp/olymp/ejik/2015s.html
<div class="Page">

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Четвёртая командная олимпиада по программированию Ёjik</h2>
<div class="outline-text-2" id="text-1">
<p>
<b>17 мая 2015 года</b> состоится четвёртая командная олимпиада по
программированию Ёjik (произносится «ёжик»).
Это командное соревнование, которое проводится в один компьютерный тур
продолжительностью 3 часа. Команде из трёх человек предоставляется один
персональный компьютер и предлагается решить несколько задач. Для решения
участники могут использовать следующие языки программирования: C/C++, C#,
Java, Pascal, Python.
</p>

<p>
Задачи олимпиады рассчитаны на самый широкий круг участников: они в
большинстве своем доступны школьникам, не овладевшим целиком основами
языка программирования (например, школьникам, не владеющим строками
или двумерными массивами, будут доступны большинство задач).
</p>

<p>
Понять уровень олимпиады можно посмотрев материалы прошедших
соревнований:
</p>

<ul class="org-ul">
<li><a href="./2013.html">Осень 2013 года</a>
</li>
<li><a href="./2014s.html">Весна 2014 года</a>
</li>
<li><a href="./2014a.html">Осень 2014 года</a>
</li>
</ul>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><a href="http://ejudge.oplab.org/cgi-bin/new-client?contest_id=77&locale_id=1">Вход в проверяющую систему</a></h3>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><a href="./2015s-statements.pdf">Условия задач</a></h3>
</div>
<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><a href="./tests-fake.zip">Тесты для третьей задачи</a></h3>
</div>
<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><a href="http://school.oplab.org/standings.html">Текущие результаты</a></h3>
</div>

<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5">Регистрация</h3>
<div class="outline-text-3" id="text-1-5">
<p>
Для участия в турнире необходимо до 15 мая отправить письмо по адресу
<code>oleg.pestov@gmail.com</code>. В письме необходимо указать:
</p>

<ul class="org-ul">
<li>учебное заведение (если участники представляют разные учебные заведения, то укажите все)
</li>
<li>название команды
</li>
<li>состав команды (для каждого школьника укажите фамилию, имя и класс)
</li>
<li>необходимое программное обеспечение (например: PascalABC.NET, CodeBlocks 12.04)
</li>
</ul>

<p>
Кроме того, если вы участвуете дистанционно <b><b>и</b></b> хотите получить оригиналы
дипломов, то укажите почтовый адрес на который их следует отправить (индекс,
адрес, получатель).
</p>
</div>
</div>

<div id="outline-container-sec-1-6" class="outline-3">
<h3 id="sec-1-6">Правила олимпиады</h3>
<div class="outline-text-3" id="text-1-6">
<ul class="org-ul">
<li>В олимпиаде принимают участие команды, каждая из которых составлена из трёх
школьников.
</li>
<li>Олимпиада проводится в один компьютерный тур. На туре команде предоставляется
персональный компьютер и предлагается решить несколько
задач. Продолжительность тура — 3 часа.
</li>
<li>Во время тура разрешается пользоваться любой литературой и личными
записями. Запрещается использовать любую информацию в электронном виде, а
также технику, за исключением предоставляемого компьютера.
</li>
<li>Во время тура участники решают предложенные задачи. Решением задачи является
программа, составленная на одном из допустимых языков
программирования. Программа не должна содержать вспомогательных модулей или
файлов. Разные задачи можно решать на разных языках программирования.
</li>
<li>Все задачи предполагают, что входные данные поступают из стандартного потока
ввода («ввод с клавиатуры»), а результаты должны быть выведены в стандартный
поток вывода («вывод на экран»).
</li>
<li>Проверка решений производится во время соревнований. По мере готовности,
решения сдаются в автоматизированную тестирующую систему. Программа
проверяется в течение нескольких минут, на заранее подготовленном жюри,
одинаковом для всех участников наборе тестов. После того, как решение будет
проверено, команда получает сообщение с результатами тестирования.
</li>
<li>Оценка решения зависит от пройденных тестов. Тесты разбиты на группы. Если все
тесты группы пройдены, то к баллам за задачу прибавляется стоимость данной
группы.  Если хотя бы один тест из группы не пройден, то баллы за неё не
начисляются. Максимальная оценка за все задачи — 100 баллов.  Кроме этого, за
каждую посылку частично верного или неверного решения снимается один
балл. Количество баллов за задачу не бывает отрицательным.
</li>
<li>Побеждает команда, набравшая больше всего баллов.
</li>
<li>Во всех задачах требуется написать консольное приложение. Время тестирования
решения и доступная память на каждом тесте ограничены (как правило 1 секунда и
64 мегабайта). Решения, превысившие установленное ограничение, считаются
неэффективными для данной задачи. В этом случае тест считается не
пройденным. Жюри указывает ограничения на время работы программы на одном
тесте и на размер доступной памяти в формулировках задач.
</li>
<li>Во время тура участники могут общаться только с членами своей команды и
представителями жюри.
</li>
<li>За нарушение правил олимпиады команда может быть дисквалифицирована.
</li>
</ul>

</div>
</div>
</div>

<div id="outline-container-sec-1-7" class="outline-3">
<h3 id="sec-1-7">Место очного проведения</h3>
<div class="outline-text-3" id="text-1-7">
<p>
КОГОАУ «Кировский физико-математический лицей», г. Киров, ул. Труда 16.
</p>
</div>
</div>

<div id="outline-container-sec-1-8" class="outline-3">
<h3 id="sec-1-8">Расписание</h3>
<div class="outline-text-3" id="text-1-8">
<p>
<b>17 мая 2015 года:</b>
</p>

<dl class="org-dl">
<dt> 9:30 - 10:00 </dt><dd>открытие, объяснение правил
</dd>
<dt> 10:00 - 13:00 </dt><dd>cоревнование
</dd>
<dt> 13:00 </dt><dd>подведение итогов
</dd>
</dl>
</div>
</div>

<div id="outline-container-sec-1-9" class="outline-3">
<h3 id="sec-1-9">Жюри олимпиады</h3>
<div class="outline-text-3" id="text-1-9">
<ul class="org-ul">
<li>Ашихмин Анатолий Александрович КОГОАУ КФМЛ, г. Киров
</li>
<li>Будин Николай Алексеевич, КОГОАУ КФМЛ, г. Киров
</li>
<li>Бураков Иван Александрович, Лицей, г. Кирово-Чепецк
</li>
<li>Дехтерев Кирилл Евгеньевич, КОГОАУ КФМЛ, г. Киров
</li>
<li>Кайсин Илья Сергеевич, КОГОАУ КФМЛ, г. Киров
</li>
<li>Латышев Алексей Сергеевич, НИУ ИТМО, г. Санкт-Петербург
</li>
<li>Пестов Олег Александрович, КОГОАУ КФМЛ, г. Киров
</li>
<li>Радаев Вадим Александрович, КОГОАУ КФМЛ, г. Киров
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-10" class="outline-3">
<h3 id="sec-1-10">Организационный комитет</h3>
<div class="outline-text-3" id="text-1-10">
<ul class="org-ul">
<li>Пестов Олег Александрович, КОГОАУ КФМЛ, г. Киров
</li>
<li>Щепин Тимофей Аркадьевич, КОГОАУ КФМЛ, г. Киров
</li>
<li>Ямбарышева Светлана Юрьевна, КОГОАУ КФМЛ, г. Киров
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-11" class="outline-3">
<h3 id="sec-1-11">Контакты</h3>
<div class="outline-text-3" id="text-1-11">
<p>
Пестов Олег Александрович, +7(909)143-5774, <code>oleg.pestov@gmail.com</code>.
</p>
</div>
</div>
</div>
